luckyhegde6/IoT/2019/Final Year Project/MSP-EXP430FR5969 Software Examples/Source/430BOOST-SHARP96_GrlibExample_FR5969/driverlib/MSP430FR5xx_6xx/adc12_b.c
    //Make sure the ENC bit is cleared before initializing the ADC12
    HWREG8(baseAddress + OFS_ADC12CTL0_L) &= ~ADC12ENC;

    uint8_t retVal = STATUS_SUCCESS;

    //Turn OFF ADC12B Module & Clear Interrupt Registers
    HWREG16(baseAddress + OFS_ADC12CTL0) &= ~(ADC12ON + ADC12ENC + ADC12SC);
    HWREG16(baseAddress + OFS_ADC12IER0)  &= 0x0000; //Reset ALL interrupt enables
    HWREG16(baseAddress + OFS_ADC12IER1)  &= 0x0000;
    HWREG16(baseAddress + OFS_ADC12IER2)  &= 0x0000;
    HWREG16(baseAddress + OFS_ADC12IFGR0)  &= 0x0000; //Reset ALL interrupt flags
    HWREG16(baseAddress + OFS_ADC12IFGR1)  &= 0x0000;
    HWREG16(baseAddress + OFS_ADC12IFGR2)  &= 0x0000;

    //Set ADC12B Control 1
    HWREG16(baseAddress + OFS_ADC12CTL1) =
        sampleHoldSignalSourceSelect //Setup the Sample-and-Hold Source
        + (clockSourceDivider & ADC12DIV_7) //Set Clock Divider
        + (clockSourcePredivider & ADC12PDIV__64)
        + clockSourceSelect; //Setup Clock Source

    //Set ADC12B Control 2
    HWREG16(baseAddress + OFS_ADC12CTL2) =
        ADC12RES_2; //Default resolution to 12-bits

    //Set ADC12B Control 3
    HWREG16(baseAddress + OFS_ADC12CTL3) =
    	internalChannelMap; // Map internal channels

    return (retVal) ;
}

//*****************************************************************************
//
//! Enables the ADC12B block.
//!
//! \param baseAddress is the base address of the ADC12B module.
//!
//! This will enable operation of the ADC12B block.
//! Modified bits are \b ADC12ON of \b ADC12CTL0 register.
//!
//! \return None.
//
//*****************************************************************************
void ADC12_B_enable (uint32_t baseAddress)
{
    //Enable the ADC12B Module
    HWREG8(baseAddress + OFS_ADC12CTL0_L) |= ADC12ON;
}

//*****************************************************************************
//
//! Disables the ADC12B block.
//!
//! \param baseAddress is the base address of the ADC12B module.
//!
//! This will disable operation of the ADC12B block.
//! Modified bits are \b ADC12ON of \b ADC12CTL0 register.
//!
//! \return None.
//
//*****************************************************************************
void ADC12_B_disable (uint32_t baseAddress)
{
    //Disable ADC12B module
    HWREG8(baseAddress + OFS_ADC12CTL0_L) &= ~ADC12ON;
}


//*****************************************************************************
//
//! Sets up and enables the Sampling Timer Pulse Mode.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param clockCycleHoldCountLowMem sets the amount of clock cycles to
//!       sample-and-hold for the higher memory buffers 0-7.
//!        Valid values are
//!        \b ADC12_B_CYCLEHOLD_4_CYCLES [Default]
//!        \b ADC12_B_CYCLEHOLD_8_CYCLES
//!        \b ADC12_B_CYCLEHOLD_16_CYCLES
//!        \b ADC12_B_CYCLEHOLD_32_CYCLES
//!        \b ADC12_B_CYCLEHOLD_64_CYCLES
//!        \b ADC12_B_CYCLEHOLD_96_CYCLES
//!        \b ADC12_B_CYCLEHOLD_128_CYCLES
//!        \b ADC12_B_CYCLEHOLD_192_CYCLES
//!        \b ADC12_B_CYCLEHOLD_256_CYCLES
//!        \b ADC12_B_CYCLEHOLD_384_CYCLES
//!        \b ADC12_B_CYCLEHOLD_512_CYCLES
//!        \b ADC12_B_CYCLEHOLD_768_CYCLES
//!        \b ADC12_B_CYCLEHOLD_1024_CYCLES
//!        Modified bits are \b ADC12SHT0x of \b ADC12CTL0 register.
//! \param clockCycleHoldCountHighMem sets the amount of clock cycles to
//!       sample-and-hold for the higher memory buffers 8-15.
//!        Valid values are
//!        \b ADC12_B_CYCLEHOLD_4_CYCLES [Default]
//!        \b ADC12_B_CYCLEHOLD_8_CYCLES
//!        \b ADC12_B_CYCLEHOLD_16_CYCLES
//!        \b ADC12_B_CYCLEHOLD_32_CYCLES
//!        \b ADC12_B_CYCLEHOLD_64_CYCLES
//!        \b ADC12_B_CYCLEHOLD_96_CYCLES
//!        \b ADC12_B_CYCLEHOLD_128_CYCLES
//!        \b ADC12_B_CYCLEHOLD_192_CYCLES
//!        \b ADC12_B_CYCLEHOLD_256_CYCLES
//!        \b ADC12_B_CYCLEHOLD_384_CYCLES
//!        \b ADC12_B_CYCLEHOLD_512_CYCLES
//!        \b ADC12_B_CYCLEHOLD_768_CYCLES
//!        \b ADC12_B_CYCLEHOLD_1024_CYCLES
//!        Modified bits are \b ADC12SHT1x of \b ADC12CTL0 register.
//! \param multipleSamplesEnabled allows multiple conversions to start
//!       without a trigger signal from the sample/hold signal
//!        Valid values are
//!        \b ADC12_B_MULTIPLESAMPLESDISABLE - a timer trigger will be needed to
//!                  start every ADC conversion. [Default]
//!        \b ADC12_B_MULTIPLESAMPLESENABLE  - during a sequenced and/or repeated
//!                  conversion mode, after the first conversion, no sample/hold
//!                  signal is necessary to start subsequent sample/hold and
//!                  convert processes.
//!        Modified bits are \b ADC12MSC of \b ADC12CTL0 register.
//!
//! This function sets up the sampling timer pulse mode which allows the
//! sample/hold signal to trigger a sampling timer to sample-and-hold an input
//! signal for a specified number of clock cycles without having to hold the
//! sample/hold signal for the entire period of sampling. Note that if a
//! conversion has been started with the startConversion() function, then a call
//! to disableConversions() is required before this function may be called.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_B_setupSamplingTimer (uint32_t baseAddress,
    uint16_t clockCycleHoldCountLowMem,
    uint16_t clockCycleHoldCountHighMem,
    uint16_t multipleSamplesEnabled)
{
    //Make sure the ENC bit is cleared before setting up sampling pulse mode
    assert( !(HWREG8(baseAddress + OFS_ADC12CTL0_L) & ADC12ENC) );

    assert(clockCycleHoldCountLowMem <= ADC12_B_CYCLEHOLD_1024_CYCLES);
    assert(clockCycleHoldCountHighMem <= ADC12_B_CYCLEHOLD_1024_CYCLES);

    HWREG16(baseAddress + OFS_ADC12CTL1) |= ADC12SHP;

    //Reset clock cycle hold counts and msc bit before setting them
    HWREG16(baseAddress + OFS_ADC12CTL0) &=
        ~(ADC12SHT0_15 + ADC12SHT1_15 + ADC12MSC);

