luckyhegde6/IoT/2019/Final Year Project/MSP-EXP430FR5969 Software Examples/Source/430BOOST-SHARP96_GrlibExample_FR5969/driverlib/MSP430FR5xx_6xx/adc12_b.c
    //Set clock cycle hold counts and msc bit
    HWREG16(baseAddress + OFS_ADC12CTL0) |= clockCycleHoldCountLowMem
                                          + (clockCycleHoldCountHighMem << 4)
                                          + multipleSamplesEnabled;
}

//*****************************************************************************
//
//! Disables Sampling Timer Pulse Mode.
//!
//! \param baseAddress is the base address of the ADC12B module.
//!
//! Disables the Sampling Timer Pulse Mode. Note that if a conversion has been
//! started with the startConversion() function, then a call to
//! disableConversions() is required before this function may be called.
//!
//! Modified bits are \b ADC12SHP of \b ADC12CTL1 register.
//! \return NONE
//
//*****************************************************************************
void ADC12_B_disableSamplingTimer (uint32_t baseAddress)
{
    //Make sure the ENC bit is cleared before disabling sampling pulse mode
    assert( !(HWREG8(baseAddress + OFS_ADC12CTL0_L) & ADC12ENC) );

    HWREG16(baseAddress + OFS_ADC12CTL1) &= ~(ADC12SHP);
}

//*****************************************************************************
//
//! Configures the controls of the selected memory buffer.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param memoryBufferControlIndex is the selected memory buffer to set the
//!       configuration for.
//!        Valid values are
//!        \b ADC12_B_MEMORY_0  (0x00)
//!        \b ADC12_B_MEMORY_1  (0x02)
//!        \b ADC12_B_MEMORY_2  (0x04)
//!        \b ADC12_B_MEMORY_3  (0x06)
//!        \b ADC12_B_MEMORY_4  (0x08)
//!        \b ADC12_B_MEMORY_5  (0x0A)
//!        \b ADC12_B_MEMORY_6  (0x0C)
//!        \b ADC12_B_MEMORY_7  (0x0E)
//!        \b ADC12_B_MEMORY_8  (0x10)
//!        \b ADC12_B_MEMORY_9  (0x12)
//!        \b ADC12_B_MEMORY_10 (0x14)
//!        \b ADC12_B_MEMORY_11 (0x16)
//!        \b ADC12_B_MEMORY_12 (0x18)
//!        \b ADC12_B_MEMORY_13 (0x1A)
//!        \b ADC12_B_MEMORY_14 (0x1C)
//!        \b ADC12_B_MEMORY_15 (0x1E)
//!        \b ADC12_B_MEMORY_16 (0x20)
//!        \b ADC12_B_MEMORY_17 (0x22)
//!        \b ADC12_B_MEMORY_18 (0x24)
//!        \b ADC12_B_MEMORY_19 (0x26)
//!        \b ADC12_B_MEMORY_20 (0x28)
//!        \b ADC12_B_MEMORY_21 (0x2A)
//!        \b ADC12_B_MEMORY_22 (0x2C)
//!        \b ADC12_B_MEMORY_23 (0x2E)
//!        \b ADC12_B_MEMORY_24 (0x30)
//!        \b ADC12_B_MEMORY_25 (0x32)
//!        \b ADC12_B_MEMORY_26 (0x34)
//!        \b ADC12_B_MEMORY_27 (0x36)
//!        \b ADC12_B_MEMORY_28 (0x38)
//!        \b ADC12_B_MEMORY_29 (0x3A)
//!        \b ADC12_B_MEMORY_30 (0x3C)
//!        \b ADC12_B_MEMORY_31 (0x3E)
//! \param inputSourceSelect is the input that will store the converted data
//!       into the specified memory buffer.
//!        Valid values are
//!        \b ADC12_B_INPUT_A0	[Default]
//!        \b ADC12_B_INPUT_A1
//!        \b ADC12_B_INPUT_A2
//!        \b ADC12_B_INPUT_A3
//!        \b ADC12_B_INPUT_A4
//!        \b ADC12_B_INPUT_A5
//!        \b ADC12_B_INPUT_A6
//!        \b ADC12_B_INPUT_A7
//!        \b ADC12_B_INPUT_A8
//!        \b ADC12_B_INPUT_A9
//!        \b ADC12_B_INPUT_A10
//!        \b ADC12_B_INPUT_A11
//!        \b ADC12_B_INPUT_A12
//!        \b ADC12_B_INPUT_A13
//!        \b ADC12_B_INPUT_A14
//!        \b ADC12_B_INPUT_A15
//!        \b ADC12_B_INPUT_A16
//!        \b ADC12_B_INPUT_A17
//!        \b ADC12_B_INPUT_A18
//!        \b ADC12_B_INPUT_A19
//!        \b ADC12_B_INPUT_A20
//!        \b ADC12_B_INPUT_A21
//!        \b ADC12_B_INPUT_A22
//!        \b ADC12_B_INPUT_A23
//!        \b ADC12_B_INPUT_A24
//!        \b ADC12_B_INPUT_A25
//!        \b ADC12_B_INPUT_A26
//!        \b ADC12_B_INPUT_A27
//!        \b ADC12_B_INPUT_A28
//!        \b ADC12_B_INPUT_A29
//!        \b ADC12_B_INPUT_TCMAP
//!        \b ADC12_B_INPUT_BATMAP
//!        Modified bits are \b ADC12INCHx of \b ADC12MCTLx register.
//! \param refVoltageSourceSelect is the reference voltage source to set
//!       as the upper/lower limits for the conversion stored in the specified memory.
//!        Valid values are
//!        \b ADC12_B_VREFPOS_AVCC_VREFNEG_VSS  		[Default]
//!        \b ADC12_B_VREFPOS_INTBUF_VREFNEG_VSS
//!        \b ADC12_B_VREFPOS_EXTNEG_VREFNEG_VSS
//!        \b ADC12_B_VREFPOS_EXTBUF_VREFNEG_VSS
//!        \b ADC12_B_VREFPOS_EXTPOS_VREFNEG_VSS
//!        \b ADC12_B_VREFPOS_AVCC_VREFNEG_EXTBUF
//!        \b ADC12_B_VREFPOS_AVCC_VREFNEG_EXTPOS
//!        \b ADC12_B_VREFPOS_INTBUF_VREFNEG_EXTPOS
//!        \b ADC12_B_VREFPOS_AVCC_VREFNEG_INTBUF
//!        \b ADC12_B_VREFPOS_EXTPOS_VREFNEG_INTBUF
//!        \b ADC12_B_VREFPOS_AVCC_VREFNEG_EXTNEG
//!        \b ADC12_B_VREFPOS_INTBUF_VREFNEG_EXTNEG
//!        \b ADC12_B_VREFPOS_EXTPOS_VREFNEG_EXTNEG
//!        \b ADC12_B_VREFPOS_EXTBUF_VREFNEG_EXTNEG
//!        Modified bits are \b ADC12VRSEL of \b ADC12MCTLx register.
//! \param endOfSequence indicates that the specified memory buffer will be
//!       the end of the sequence if a sequenced conversion mode is selected
//!        Valid values are
//!        \b ADC12_B_NOTENDOFSEQUENCE - The specified memory buffer will NOT be the
//!                  end of the sequence OR a sequenced conversion mode is not
//!                  selected. [Default]
//!        \b ADC12_B_ENDOFSEQUENCE  - The specified memory buffer will be the end
//!                  of the sequence.
//!        Modified bits are \b ADC12EOS of \b ADC12MCTLx register.
//! \param windowComparatorSelect sets the window comparator mode
//!        Valid values are
//!        \b ADC12_B_WINDOW_COMPARATOR_DISABLE [Default]
//!        \b ADC12_B_WINDOW_COMPARATOR_ENABLE
//! \param differentialModeSelect sets the differential mode
//!        Valid values are
//!        \b ADC12_B_DIFFERENTIAL_MODE_DISABLE [Default]
//!        \b ADC12_B_DIFFERENTIAL_MODE_ENABLE
//!
//! Maps an input signal conversion into the selected memory buffer, as
//! well as the positive and negative reference voltages for each conversion
//! being stored into this memory buffer. If the internal reference is used for
//! the positive reference voltage, the internal REF module must be used to
//! control the voltage level. Note that if a conversion has been started with
//! the startConversion() function, then a call to disableConversions() is
//! required before this function may be called.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_B_memoryConfigure (uint32_t baseAddress,
    uint8_t memoryBufferControlIndex,
    uint8_t inputSourceSelect,
    uint16_t refVoltageSourceSelect,
    uint16_t endOfSequence,
    uint16_t windowComparatorSelect,
    uint16_t differentialModeSelect
    )
{
    //Make sure the ENC bit is cleared before configuring a Memory Buffer Control
    assert( !(HWREG8(baseAddress + OFS_ADC12CTL0_L) & ADC12ENC) );

    assert(inputSourceSelect <= ADC12_B_INPUT_BATMAP);
    assert(refVoltageSourceSelect <= ADC12_B_VREFPOS_EXTBUF_VREFNEG_EXTNEG);
    
