luckyhegde6/IoT/2019/Final Year Project/MSP-EXP430FR5969 Software Examples/Source/430BOOST-SHARP96_GrlibExample_FR5969/driverlib/MSP430FR5xx_6xx/adc12_b.c
    HWREG16(baseAddress + OFS_ADC12IER0) |= interruptMask0;
    HWREG16(baseAddress + OFS_ADC12IER1) |= interruptMask1;
    HWREG16(baseAddress + OFS_ADC12IER2) |= interruptMask2;
}

//*****************************************************************************
//
//! Disables selected ADC12B interrupt sources.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param interruptMask0 is the bit mask of the memory buffer and overflow
//!       interrupt sources to be disabled.  If the desired interrupt is not available in
//!			the selection for interruptMask0, then simply pass in a '0' for this value.
//!        Valid values are
//!        \b ADC12_B_IE0
//!        \b ADC12_B_IE1
//!        \b ADC12_B_IE2
//!        \b ADC12_B_IE3
//!        \b ADC12_B_IE4
//!        \b ADC12_B_IE5
//!        \b ADC12_B_IE6
//!        \b ADC12_B_IE7
//!        \b ADC12_B_IE8
//!        \b ADC12_B_IE9
//!        \b ADC12_B_IE10
//!        \b ADC12_B_IE11
//!        \b ADC12_B_IE12
//!        \b ADC12_B_IE13
//!        \b ADC12_B_IE14
//!        \b ADC12_B_IE15
//! \param interruptMask1 is the bit mask of the memory buffer and overflow
//!       interrupt sources to be disabled.  If the desired interrupt is not available in
//!			the selection for interruptMask1, then simply pass in a '0' for this value.
//!        Valid values are
//!        \b ADC12_B_IE16
//!        \b ADC12_B_IE17
//!        \b ADC12_B_IE18
//!        \b ADC12_B_IE19
//!        \b ADC12_B_IE20
//!        \b ADC12_B_IE21
//!        \b ADC12_B_IE22
//!        \b ADC12_B_IE23
//!        \b ADC12_B_IE24
//!        \b ADC12_B_IE25
//!        \b ADC12_B_IE26
//!        \b ADC12_B_IE27
//!        \b ADC12_B_IE28
//!        \b ADC12_B_IE29
//!        \b ADC12_B_IE30
//!        \b ADC12_B_IE31
//! \param interruptMask2 is the bit mask of the memory buffer and overflow
//!       interrupt sources to be disabled.  If the desired interrupt is not available in
//!			the selection for interruptMask2, then simply pass in a '0' for this value.
//!        Valid values are
//!        \b ADC12_B_INIE - Interrupt enable for a conversion in the result register
//!							is either greater than the ADC12LO or lower than the ADC12HI
//!							threshold.
//!							GIE bit must be set to enable the interrupt.
//!        \b ADC12_B_LOIE - Interrupt enable for the falling short of the lower
//!							limit interrupt of the window comparator for the result register.
//!							GIE bit must be set to enable the interrupt.
//!        \b ADC12_B_HIIE - Interrupt enable for the exceeding the upper limit
//!							of the window comparator for the result register.
//!							GIE bit must be set to enable the interrupt.
//!        \b ADC12_B_OVIE - Interrupt enable for a conversion that is about to
//!                  		save to a memory buffer that has not been read out yet.
//!							GIE bit must be set to enable the interrupt.
//!        \b ADC12_B_TOVIE -Interrupt enable for a conversion that is about
//!                  		to start before the previous conversion has been completed.
//!							GIE bit must be set to enable the interrupt.
//!        \b ADC12_B_RDYIE -Interrupt enable for the local buffered reference ready signal.
//!							GIE bit must be set to enable the interrupt.
//! Disables the indicated ADC12B interrupt sources.  Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor.
//!
//! Modified registers are \b ADC12CTL0 and \b ADC12IE.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_B_disableInterrupt (uint32_t baseAddress,
    uint16_t interruptMask0,
    uint16_t interruptMask1,
    uint16_t interruptMask2)
{
    assert(interruptMask2 <= (
			ADC12_B_INIE + ADC12_B_LOIE + ADC12_B_HIIE + ADC12_B_OVIE +	ADC12_B_TOVIE + ADC12_B_RDYIE
			));


    HWREG16(baseAddress + OFS_ADC12IER0) &= ~(interruptMask0);
    HWREG16(baseAddress + OFS_ADC12IER1) &= ~(interruptMask1);
    HWREG16(baseAddress + OFS_ADC12IER2) &= ~(interruptMask2);
}

//*****************************************************************************
//
//! Clears ADC12B selected interrupt flags.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param interruptRegisterChoice is either 0, 1, or 2, to choose the correct
//!       interrupt register to update
//! \param memoryInterruptFlagMask is the bit mask of the memory buffer and overflow
//!       interrupt flags to be cleared.
//!        Valid values are
//!        \b ADC12_B_IFG0		interruptRegisterChoice = 0
//!        \b ADC12_B_IFG1
//!        \b ADC12_B_IFG2
//!        \b ADC12_B_IFG3
//!        \b ADC12_B_IFG4
//!        \b ADC12_B_IFG5
//!        \b ADC12_B_IFG6
//!        \b ADC12_B_IFG7
//!        \b ADC12_B_IFG8
//!        \b ADC12_B_IFG9
//!        \b ADC12_B_IFG10
//!        \b ADC12_B_IFG11
//!        \b ADC12_B_IFG12
//!        \b ADC12_B_IFG13
//!        \b ADC12_B_IFG14
//!        \b ADC12_B_IFG15
//!        \b ADC12_B_IFG16		interruptRegisterChoice = 1
//!        \b ADC12_B_IFG17
//!        \b ADC12_B_IFG18
//!        \b ADC12_B_IFG19
//!        \b ADC12_B_IFG20
//!        \b ADC12_B_IFG21
//!        \b ADC12_B_IFG22
//!        \b ADC12_B_IFG23
//!        \b ADC12_B_IFG24
//!        \b ADC12_B_IFG25
//!        \b ADC12_B_IFG26
//!        \b ADC12_B_IFG27
//!        \b ADC12_B_IFG28
//!        \b ADC12_B_IFG29
//!        \b ADC12_B_IFG30
//!        \b ADC12_B_IFG31
//!        \b ADC12_B_INIFG		interruptRegisterChoice = 2
//!        \b ADC12_B_LOIFG
//!        \b ADC12_B_HIIFG
//!        \b ADC12_B_OVIFG
//!        \b ADC12_B_TOVIFG
//!        \b ADC12_B_RDYIFG
//! The selected ADC12B interrupt flags are cleared, so that it no longer asserts.
//! The memory buffer interrupt flags are only cleared when the memory buffer is
//! accessed. Note that the overflow interrupts do not have an interrupt flag to
//! clear; they must be accessed directly from the interrupt vector.
//!
//! Modified registers are \b ADC12IFG.
//
//! \return NONE
//
//*****************************************************************************
void ADC12_B_clearInterrupt (uint32_t baseAddress,
	uint8_t interruptRegisterChoice,
    uint16_t memoryInterruptFlagMask)
{
	HWREG16(baseAddress + OFS_ADC12IFGR0 + 2*interruptRegisterChoice) &= memoryInterruptFlagMask;

