luckyhegde6/IoT/2019/Final Year Project/MSP-EXP430FR5969 Software Examples/Source/430BOOST-SHARP96_GrlibExample_FR5969/driverlib/MSP430FR5xx_6xx/adc12_b.c
}

//*****************************************************************************
//
//! Returns the status of the selected memory interrupt flags.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param interruptRegisterChoice is either 0, 1, or 2, to choose the correct
//!       interrupt register to update
//! \param memoryInterruptFlagMask is the bit mask of the memory buffer and overflow
//!       interrupt flags to be cleared.
//!        Valid values are
//!        \b ADC12_B_IFG0		interruptRegisterChoice = 0
//!        \b ADC12_B_IFG1
//!        \b ADC12_B_IFG2
//!        \b ADC12_B_IFG3
//!        \b ADC12_B_IFG4
//!        \b ADC12_B_IFG5
//!        \b ADC12_B_IFG6
//!        \b ADC12_B_IFG7
//!        \b ADC12_B_IFG8
//!        \b ADC12_B_IFG9
//!        \b ADC12_B_IFG10
//!        \b ADC12_B_IFG11
//!        \b ADC12_B_IFG12
//!        \b ADC12_B_IFG13
//!        \b ADC12_B_IFG14
//!        \b ADC12_B_IFG15
//!        \b ADC12_B_IFG16		interruptRegisterChoice = 1
//!        \b ADC12_B_IFG17
//!        \b ADC12_B_IFG18
//!        \b ADC12_B_IFG19
//!        \b ADC12_B_IFG20
//!        \b ADC12_B_IFG21
//!        \b ADC12_B_IFG22
//!        \b ADC12_B_IFG23
//!        \b ADC12_B_IFG24
//!        \b ADC12_B_IFG25
//!        \b ADC12_B_IFG26
//!        \b ADC12_B_IFG27
//!        \b ADC12_B_IFG28
//!        \b ADC12_B_IFG29
//!        \b ADC12_B_IFG30
//!        \b ADC12_B_IFG31
//!        \b ADC12_B_INIFG		interruptRegisterChoice = 2
//!        \b ADC12_B_LOIFG
//!        \b ADC12_B_HIIFG
//!        \b ADC12_B_OVIFG
//!        \b ADC12_B_TOVIFG
//!        \b ADC12_B_RDYIFG
//! Returns the status of the selected memory interrupt flags. Note that the
//! overflow interrupts do not have an interrupt flag to clear; they must be
//! accessed directly from the interrupt vector.
//!
//! \return The current interrupt flag status for the corresponding mask.
//
//*****************************************************************************
uint8_t ADC12_B_getInterruptStatus (uint32_t baseAddress,
	uint8_t interruptRegisterChoice,
	uint16_t memoryInterruptFlagMask)
{
    return ( HWREG16(baseAddress + OFS_ADC12IFGR0 + 2*interruptRegisterChoice)
    		& memoryInterruptFlagMask );
}

//*****************************************************************************
//
//! Enables/Starts an Analog-to-Digital Conversion.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param startingMemoryBufferIndex is the memory buffer that will hold the
//!       first or only conversion.
//!        Valid values are
//!        \b START_AT_ADC12MEM0	[Default]
//!        \b START_AT_ADC12MEM1
//!        \b START_AT_ADC12MEM2
//!        \b START_AT_ADC12MEM3
//!        \b START_AT_ADC12MEM4
//!        \b START_AT_ADC12MEM5
//!        \b START_AT_ADC12MEM6
//!        \b START_AT_ADC12MEM7
//!        \b START_AT_ADC12MEM8
//!        \b START_AT_ADC12MEM9
//!        \b START_AT_ADC12MEM10
//!        \b START_AT_ADC12MEM11
//!        \b START_AT_ADC12MEM12
//!        \b START_AT_ADC12MEM13
//!        \b START_AT_ADC12MEM14
//!        \b START_AT_ADC12MEM15
//!        \b START_AT_ADC12MEM16
//!        \b START_AT_ADC12MEM17
//!        \b START_AT_ADC12MEM18
//!        \b START_AT_ADC12MEM19
//!        \b START_AT_ADC12MEM20
//!        \b START_AT_ADC12MEM21
//!        \b START_AT_ADC12MEM22
//!        \b START_AT_ADC12MEM23
//!        \b START_AT_ADC12MEM24
//!        \b START_AT_ADC12MEM25
//!        \b START_AT_ADC12MEM26
//!        \b START_AT_ADC12MEM27
//!        \b START_AT_ADC12MEM28
//!        \b START_AT_ADC12MEM29
//!        \b START_AT_ADC12MEM30
//!        \b START_AT_ADC12MEM31
//!        Modified bits are \b ADC12CSTARTADDx of \b ADC12CTL1 register.
//! \param conversionSequenceModeSelect determines the ADC operating mode.
//!        Valid values are
//!        \b ADC12_B_SINGLECHANNEL - one-time conversion of a single channel into
//!           a single memory buffer. [Default]
//!        \b ADC12_B_SEQOFCHANNELS - one time conversion of multiple channels
//!           into the specified starting memory buffer and each subsequent
//!           memory buffer up until the conversion is stored in a memory buffer
//!           dedicated as the end-of-sequence by the memory's control register.
//!        \b ADC12_B_REPEATED_SINGLECHANNEL - repeated conversions of one channel
//!           into a single memory buffer.
//!        \b ADC12_B_REPEATED_SEQOFCHANNELS - repeated conversions of multiple
//!           channels into the specified starting memory buffer and each
//!           subsequent memory buffer up until the conversion is stored in a
//!           memory buffer dedicated as the end-of-sequence by the memory's
//!           control register.
//!        Modified bits are \b ADC12CONSEQx of \b ADC12CTL1 register.
//!
//! This function  enables/starts the conversion process of the ADC.
//! If the sample/hold signal source chosen during initialization was
//! ADC12OSC, then the conversion is started immediately, otherwise the chosen
//! sample/hold signal source starts the conversion by a rising edge of the
//! signal. Keep in mind when selecting conversion modes, that for sequenced
//! and/or repeated modes, to keep the sample/hold-and-convert process
//! continuing without a trigger from the sample/hold signal source, the
//! multiple samples must be enabled using the ADC12_B_setupSamplingTimer()
//! function. Note that after this function is called, the
//! ADC12_B_stopConversions() has to be called to re-initialize the ADC,
//! reconfigure a memory buffer control, enable/disable the sampling timer, or
//! to change the internal reference voltage.
//!
//! Modified registers are \b ADC12CTL0 and \b ADC12CTL1.
//! \return NONE
//
//*****************************************************************************
void ADC12_B_startConversion (uint32_t baseAddress,
    uint16_t startingMemoryBufferIndex,
    uint8_t conversionSequenceModeSelect)
{
    assert(startingMemoryBufferIndex <= ADC12_B_MEMORY_15);
    assert(conversionSequenceModeSelect <= ADC12_B_REPEATED_SEQOFCHANNELS);

    //Reset the ENC bit to set the starting memory address and conversion mode
    //sequence
    HWREG8(baseAddress + OFS_ADC12CTL0_L) &= ~(ADC12ENC);
    //Reset the bits about to be set
    HWREG16(baseAddress + OFS_ADC12CTL3) &= ~(ADC12CSTARTADD_31);
    HWREG16(baseAddress + OFS_ADC12CTL1) &= ~(ADC12CONSEQ_3);

    HWREG16(baseAddress + OFS_ADC12CTL3) |= startingMemoryBufferIndex;
    HWREG16(baseAddress + OFS_ADC12CTL1) |= conversionSequenceModeSelect;
    HWREG8(baseAddress + OFS_ADC12CTL0_L) |= ADC12ENC + ADC12SC;
}

//*****************************************************************************
//
//! Disables the ADC from converting any more signals.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param preempt specifies if the current conversion should be preemptively
//!       stopped before the end of the conversion.
//!        Valid values are
//!        \b ADC12_B_COMPLETECONVERSION - Allows the ADC12B to end the current
//!                  conversion before disabling conversions.
//!        \b ADC12_B_PREEMPTCONVERSION - Stops the ADC12B immediately, with
//!                  unpredictable results of the current conversion.
//!
//! Disables the ADC from converting any more signals.
//! If there is a conversion in progress, this function can stop it immediately
//! if the preempt parameter is set as ADC12_B_PREEMPTCONVERSION, by changing the 
//! conversion mode to single-channel, single-conversion and disabling conversions. 
//! If the conversion mode is set as single-channel, single-conversion and this
//! function is called without preemption, then the ADC core conversion status
//! is polled until the conversion is complete before disabling conversions to
//! prevent unpredictable data. If the ADC12_B_startConversion() has been called,
//! then this function has to be called to re-initialize the ADC, reconfigure a
//! memory buffer control, enable/disable the sampling pulse mode, or change the
//! internal reference voltage.
//!
//! Modified registers are \b ADC12CTL0 and \b ADC12CTL1.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_B_disableConversions (uint32_t baseAddress, unsigned short preempt)
{
    if (ADC12_B_PREEMPTCONVERSION == preempt){
        HWREG8(baseAddress + OFS_ADC12CTL1_L) &= ~(ADC12CONSEQ_3);
        //Reset conversion sequence mode to single-channel, single-conversion
    } else if (~(HWREG8(baseAddress + OFS_ADC12CTL1_L) & ADC12CONSEQ_3)){
        //To prevent preemption of a single-channel, single-conversion we must
        //wait for the ADC core to finish the conversion.
        while (ADC12_B_isBusy(baseAddress)) ;
    }

