luckyhegde6/IoT/2019/Final Year Project/MSP-EXP430FR5969 Software Examples/Source/430BOOST-SHARP96_GrlibExample_FR5969/driverlib/MSP430FR5xx_6xx/adc12_b.c
    HWREG8(baseAddress + OFS_ADC12CTL0_L) &= ~(ADC12ENC);
}

//*****************************************************************************
//
//! Returns the raw contents of the specified memory buffer.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param memryBufferIndex is the specified Memory Buffer to read.
//!        Valid values are
//!        \b ADC12_B_MEMORY_0
//!        \b ADC12_B_MEMORY_1
//!        \b ADC12_B_MEMORY_2
//!        \b ADC12_B_MEMORY_3
//!        \b ADC12_B_MEMORY_4
//!        \b ADC12_B_MEMORY_5
//!        \b ADC12_B_MEMORY_6
//!        \b ADC12_B_MEMORY_7
//!        \b ADC12_B_MEMORY_8
//!        \b ADC12_B_MEMORY_9
//!        \b ADC12_B_MEMORY_10
//!        \b ADC12_B_MEMORY_11
//!        \b ADC12_B_MEMORY_12
//!        \b ADC12_B_MEMORY_13
//!        \b ADC12_B_MEMORY_14
//!        \b ADC12_B_MEMORY_15
//!        \b ADC12_B_MEMORY_16
//!        \b ADC12_B_MEMORY_17
//!        \b ADC12_B_MEMORY_18
//!        \b ADC12_B_MEMORY_19
//!        \b ADC12_B_MEMORY_20
//!        \b ADC12_B_MEMORY_21
//!        \b ADC12_B_MEMORY_22
//!        \b ADC12_B_MEMORY_23
//!        \b ADC12_B_MEMORY_24
//!        \b ADC12_B_MEMORY_25
//!        \b ADC12_B_MEMORY_26
//!        \b ADC12_B_MEMORY_27
//!        \b ADC12_B_MEMORY_28
//!        \b ADC12_B_MEMORY_29
//!        \b ADC12_B_MEMORY_30
//!        \b ADC12_B_MEMORY_31
//!
//! Returns the raw contents of the specified memory buffer. The format of the
//! content depends on the read-back format of the data: if the data is in
//! signed 2's complement format then the contents in the memory buffer will be
//! left-justified with the least-significant bits as 0's, whereas if the data
//! is in unsigned format then the contents in the memory buffer will be
//! right-justified with the most-significant bits as 0's.
//!
//! \return A Signed Integer of the contents of the specified memory buffer.
//
//*****************************************************************************
int ADC12_B_getResults (uint32_t baseAddress, uint8_t memoryBufferIndex)
{
    assert(memoryBufferIndex <= ADC12_B_MEMORY_31);

    return ( HWREG16(baseAddress + (OFS_ADC12MEM0 + memoryBufferIndex)) );
    //(0x60 + memoryBufferIndex) == offset of ADC12MEMx
}

//*****************************************************************************
//
//! Use to change the resolution of the converted data.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param resolutionSelect determines the resolution of the converted data.
//!        Valid values are
//!        \b ADC12_B_RESOLUTION_8BIT
//!        \b ADC12_B_RESOLUTION_10BIT
//!        \b ADC12_B_RESOLUTION_12BIT [Default]
//!        Modified bits are \b ADC12RESx of \b ADC12CTL2 register.
//!
//! This function can be used to change the resolution of the converted data
//! from the default of 12-bits.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_B_setResolution (uint32_t baseAddress,
    uint8_t resolutionSelect)
{
    assert(resolutionSelect <= ADC12_B_RESOLUTION_12BIT);

    HWREG8(baseAddress + OFS_ADC12CTL2_L) &= ~(ADC12RES_3);
    HWREG8(baseAddress + OFS_ADC12CTL2_L) |= resolutionSelect;
}

//*****************************************************************************
//
//! Use to invert or un-invert the sample/hold signal.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param invertedSignal set if the sample/hold signal should be inverted
//!        Valid values are
//!        \b ADC12_B_NONINVERTEDSIGNAL - a sample-and-hold of an input signal for
//!                  conversion will be started on a rising edge of the
//!                  sample/hold signal. [Default]
//!        \b ADC12_B_INVERTEDSIGNAL  - a sample-and-hold of an input signal for
//!                  conversion will be started on a falling edge of the
//!                  sample/hold signal.
//!        Modified bits are \b ADC12ISSH of \b ADC12CTL1 register.
//!
//! This function can be used to invert or un-invert the sample/hold signal.
//! Note that if a conversion has been started with the startConversion()
//! function, then a call to disableConversions() is required before this
//! function may be called.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_B_setSampleHoldSignalInversion (uint32_t baseAddress,
    uint16_t invertedSignal)
{
    //Make sure the ENC bit is cleared before using this function
    assert( !(HWREG8(baseAddress + OFS_ADC12CTL0_L) & ADC12ENC) );

    HWREG16(baseAddress + OFS_ADC12CTL1) &= ~(ADC12ISSH);
    HWREG16(baseAddress + OFS_ADC12CTL1) |= invertedSignal;
}

//*****************************************************************************
//
//! Use to set the read-back format of the converted data.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param readBackFormat is the specified format to store the conversions in
//!       the memory buffer.
//!        Valid values are
//!        \b ADC12_B_UNSIGNED_BINARY 	[Default]
//!        \b ADC12_B_SIGNED_2SCOMPLEMENT
//!        Modified bits are \b ADC12DF of \b ADC12CTL2 register.
//!
//! Sets the format of the converted data: how it will be stored into the
//! memory buffer, and how it should be read back. The format can be set as
//! right-justified (default), which indicates that the number will be unsigned,
//! or left-justified, which indicates that the number will be signed in
//! 2's complement format. This change affects all memory buffers for subsequent
//! conversions.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_B_setDataReadBackFormat (uint32_t baseAddress,
    uint8_t readBackFormat)
{
    assert(readBackFormat <= ADC12_B_SIGNED_2SCOMPLEMENT);

    HWREG8(baseAddress + OFS_ADC12CTL2_L) &= ~(ADC12DF);
    HWREG8(baseAddress + OFS_ADC12CTL2_L) |= readBackFormat;
}

//*****************************************************************************
//
//! Use to set the ADC's power conservation mode if the sampling rate is
//!	at 50-ksps or less.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param powerMode is the specified maximum sampling rate.
//!        Valid values are
//!        \b ADC12_B_REGULARPOWERMODE 	- If sampling rate is greater than 50-ksps,
//!										there is no power saving feature available. [Default]
//!        \b ADC12_B_LOWPOWERMODE		- If sampling rate is less than or equal
//!										to 50-ksps, select this value to save power
//!        Modified bits are \b ADC12SR of \b ADC12CTL2 register.
//!
//! Sets ADC's power mode. If the user has a sampling rate greater than 50-ksps, then
//! he/she can only enable ADC12_B_REGULARPOWERMODE.  If the sampling rate is 50-ksps or less,
//! the user can enable ADC12_B_LOWPOWERMODE granting additional power savings.
//! \return NONE
//
//*****************************************************************************
void ADC12_B_setAdcPowerMode (uint32_t baseAddress,
    uint8_t powerMode)
{
    assert((powerMode == ADC12_B_REGULARPOWERMODE) ||
    	(powerMode == ADC12_B_LOWPOWERMODE)
    );

    HWREG8(baseAddress + OFS_ADC12CTL2_L) &= ~(ADC12PWRMD);
    HWREG8(baseAddress + OFS_ADC12CTL2_L) |= powerMode;
}

//*****************************************************************************
//
//! Returns the address of the specified memory buffer for the DMA module.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param memoryIndex is the memory buffer to return the address of.
//!        Valid values are
//!        \b ADC12_B_MEMORY_0  (0x00)
//!        \b ADC12_B_MEMORY_1  (0x02)
//!        \b ADC12_B_MEMORY_2  (0x04)
//!        \b ADC12_B_MEMORY_3  (0x06)
//!        \b ADC12_B_MEMORY_4  (0x08)
//!        \b ADC12_B_MEMORY_5  (0x0A)
//!        \b ADC12_B_MEMORY_6  (0x0C)
//!        \b ADC12_B_MEMORY_7  (0x0E)
//!        \b ADC12_B_MEMORY_8  (0x10)
//!        \b ADC12_B_MEMORY_9  (0x12)
//!        \b ADC12_B_MEMORY_10 (0x14)
//!        \b ADC12_B_MEMORY_11 (0x16)
//!        \b ADC12_B_MEMORY_12 (0x18)
//!        \b ADC12_B_MEMORY_13 (0x1A)
//!        \b ADC12_B_MEMORY_14 (0x1C)
//!        \b ADC12_B_MEMORY_15 (0x1E)
//!        \b ADC12_B_MEMORY_16 (0x20)
//!        \b ADC12_B_MEMORY_17 (0x22)
//!        \b ADC12_B_MEMORY_18 (0x24)
//!        \b ADC12_B_MEMORY_19 (0x26)
//!        \b ADC12_B_MEMORY_20 (0x28)
//!        \b ADC12_B_MEMORY_21 (0x2A)
//!        \b ADC12_B_MEMORY_22 (0x2C)
//!        \b ADC12_B_MEMORY_23 (0x2E)
//!        \b ADC12_B_MEMORY_24 (0x30)
//!        \b ADC12_B_MEMORY_25 (0x32)
//!        \b ADC12_B_MEMORY_26 (0x34)
//!        \b ADC12_B_MEMORY_27 (0x36)
//!        \b ADC12_B_MEMORY_28 (0x38)
//!        \b ADC12_B_MEMORY_29 (0x3A)
//!        \b ADC12_B_MEMORY_30 (0x3C)
//!        \b ADC12_B_MEMORY_31 (0x3E)
//!
//! Returns the address of the specified  memory buffer. This can be used in
//! conjunction with the DMA to store the converted data directly to memory.
//!
//! \return address of the specified memory buffer
//
//*****************************************************************************
uint32_t ADC12_B_getMemoryAddressForDMA (uint32_t baseAddress,
    uint8_t memoryIndex)
{
    return ( baseAddress + (OFS_ADC12MEM0 + memoryIndex) );
    //(0x60 + memoryIndex) == offset of ADC12MEMx
}

//*****************************************************************************
//
//! Returns the busy status of the ADC12B core.
//!
//! \param baseAddress is the base address of the ADC12B module.
//!
//! Returns the status of the ADC core if there is a conversion currently taking
//! place.
//!
//! \return ADC12_B_BUSY or ADC12_B_NOTBUSY dependent if there is a conversion
//!        currently taking place.
//
//*****************************************************************************
uint8_t ADC12_B_isBusy (uint32_t baseAddress)
{
    return (HWREG8(baseAddress + OFS_ADC12CTL1_L) & ADC12BUSY);
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
